[{"title":"Manage your infrastructure lifecycle with new Terraform, Packer, Waypoint, and Nomad features","summary":"New Infrastructure Lifecycle Management (ILM) offerings from HashiCorp Terraform, Packer, Nomad, and Waypoint help organizations build, deploy, and manage infrastructure","link":"https://www.hashicorp.com/blog/manage-your-infrastructure-lifecycle-with-new-terraform-packer-waypoint-and-nomad","published":"2024-06-04T08:00:00Z","feedTitle":"HashiCorp Blog","feedAuthor":"HashiCorp, Inc."},{"title":"New Vault and Boundary offerings advance Security Lifecycle Management at HashiDays 2024","summary":"New Security Lifecycle Management (SLM) offerings from HashiCorp Vault and Boundary help organizations protect, inspect, and connect their most sensitive data.","link":"https://www.hashicorp.com/blog/new-vault-boundary-offerings-advance-security-lifecycle-management-hashidays-2024","published":"2024-06-04T08:00:00Z","feedTitle":"HashiCorp Blog","feedAuthor":"HashiCorp, Inc."},{"title":"Shooting satellite","summary":"","link":"https://frills.dev/blog/240605-shooting-satellite/","published":"2024-06-04T01:27:00Z","feedTitle":"Frills - Blog \u0026 experiments","feedAuthor":""},{"title":"SimpleX network: private message routing, v5.8 released with IP address protection and chat themes","summary":"SimpleX network: private message routing, v5. 8 released with IP address protection and chat themes\nPublished: June 4, 2024\nWhat's new in v5. 8:\n\nprivate message routing...","link":"https://simplex.chat/blog/20240604-simplex-chat-v5.8-private-message-routing-chat-themes.html","published":"2024-06-04T00:00:00Z","feedTitle":"SimpleX Chat Blog","feedAuthor":""},{"title":"How to use the Bitwarden forwarded email alias generator","summary":"Bitwarden includes a very handy integration called forwarded email aliases.  Learn how to use the feature in this blog","link":"https://bitwarden.com/blog/how-to-use-the-bitwarden-forwarded-email-alias-generator/","published":"2024-06-04T00:00:00Z","feedTitle":"Bitwarden Blog","feedAuthor":""},{"title":"A very masturbatory WeblogPoMo2024 retrospective, featuring me, your favorite idiot, Keenan","summary":"It seems like it was only 35 days ago that I committed myself to embarking on the challenge of posting on my blog every day for the month of May.  Despite the pessimism wrapped in a nice little facetious tortilla (new tongue-twister unlocked), I didn't actually have any sort of expectation about how the experience would go.  All I knew was that it sounded like it had the potential to be fun, it was something I otherwise wouldn't have attempted, and it would be a nice opportunity to put together a killer playlist and write about some songs I connect with...","link":"https://gkeenan.co/avgb/a-very-masturbatory-weblogpomo2024-retrospective-featuring-me-your-favorite-idiot-keenan","published":"2024-06-03T21:24:06Z","feedTitle":"A Very Good Blog by Keenan","feedAuthor":""},{"title":"Remotely access any system with a PiKVM and Tailscale","summary":"In our latest video, we use Tailscale to connect to PiKVM, an inexpensive remote access tool that runs on a Raspberry Pi and works independently of your OS","link":"https://tailscale.com/blog/remote-access-with-pikvm-and-tailscale","published":"2024-06-03T16:00:00Z","feedTitle":"Blog on Tailscale","feedAuthor":""},{"title":"Adopting OpenTelemetry for our logging pipeline","summary":"Recently, Cloudflare's Observability team undertook an effort to migrate our existing syslog-ng backed logging infrastructure to instead being backed by OpenTelemetry Collectors.  In this post, we detail the process that we undertook, and the difficulties we faced along the way","link":"https://blog.cloudflare.com/adopting-opentelemetry-for-our-logging-pipeline","published":"2024-06-03T13:00:41Z","feedTitle":" The Cloudflare Blog ","feedAuthor":""},{"title":"New zine: How Git Works!","summary":"Hello.  I’ve been writing about git on here nonstop for months, and the git zine\nis FINALLY done.  It came out on Friday...","link":"https://jvns.ca/blog/2024/04/25/new-zine--how-git-works-/","published":"2024-06-03T09:45:11Z","feedTitle":"Julia Evans","feedAuthor":"Julia Evans"},{"title":"Trying out a cycling club","summary":"For the last two years or so I’ve been cycling on my own, with a couple of small exceptions, like joining ad-hoc groups during events.  When I have joined those groups, I’ve had a great time and really enjoyed it, and yet for some reason have held off from joining a cycling club. \nI think a part of it has been a touch of anxiety, that little voice that worries that I’m not going to be a good enough cyclist, or that it’ll be elitist and I’ll be judged on the quality of my bike or gear[1]...","link":"https://lewisdale.dev/post/trying-out-a-cycling-club/","published":"2024-06-03T07:22:26Z","feedTitle":"LewisDale.dev","feedAuthor":""},{"title":"A New Hope","summary":"It's not really that uncommon for me to get feedback on my writing that goes like \"Shit, dude.  It's all doom and gloom and depression and negativity with you. \" I understand the sentiment, but I'd also recommend taking a look and really parsing the name of this blog...","link":"https://crankysec.com/blog/new_hope/","published":"2024-06-03T00:00:00Z","feedTitle":"CrankySec","feedAuthor":"Scarlett Cavendish"},{"title":"Snowflake at centre of world’s largest data breach","summary":"Cloud AI Data platform Snowflake are having a bad month.  Due to teenager threat actors and cybersecurity of its own customers… and its own cybersecurity, too, in terms of optics. There are several large data breaches playing out in the media currently...","link":"https://doublepulsar.com/snowflake-at-central-of-worlds-largest-data-breach-939fc400912e?source=rss----8343faddf0ec---4","published":"2024-06-02T11:28:36Z","feedTitle":"DoublePulsar - Medium","feedAuthor":""},{"title":"The Slash Page Scoop","summary":"Inspired by Robb Knight's recent slash pages site, I spent some time over the past week or two drafting some slash pages of my own. \n\nSlash pages are common pages you can add to your website, usually with a standard, root-level slug like /now, /about, or /uses.  They tend to describe the individual behind the site and are distinguishing characteristics of the IndieWeb...","link":"https://runtimeterror.dev/the-slash-page-scoop/","published":"2024-06-02T00:00:00Z","feedTitle":"runtimeterror","feedAuthor":""},{"title":"Protecting Children's Safety Requires End-to-End Encryption","summary":"Protecting Children's Safety Requires End-to-End Encryption\nAs lawmakers grapple with the serious issue of child exploitation online, some proposed solutions would fuel the very problem they aim to solve.  Despite expert warnings, the Belgian Presidency persists in pushing for the implementation of client-side scanning on encrypted messaging services, rebranding the effort as \"upload moderation\".  Their latest proposal mandates that providers of private communication services obtain user consent for AI-based scanning of their private chats...","link":"https://simplex.chat/blog/20240601-protecting-children-safety-requires-e2e-encryption.html","published":"2024-06-01T00:00:00Z","feedTitle":"SimpleX Chat Blog","feedAuthor":""},{"title":"Recall: Stealing everything you’ve ever typed or viewed on your own Windows PC is now possible.","summary":"Stealing everything you’ve ever typed or viewed on your own Windows PC is now possible with two lines of code — inside the Copilot+ Recall disaster. I wrote a piece recently about Copilot+ Recall, a new Microsoft Windows 11 feature which — in the words of Microsoft CEO Satya Nadella- takes “screenshots” of your PC constantly, and makes it into an instantly searchable database of everything you’ve ever seen.  As he says, it is photographic memory of your PC life...","link":"https://doublepulsar.com/recall-stealing-everything-youve-ever-typed-or-viewed-on-your-own-windows-pc-is-now-possible-da3e12e9465e?source=rss----8343faddf0ec---4","published":"2024-05-31T18:50:38Z","feedTitle":"DoublePulsar - Medium","feedAuthor":""},{"title":"Extending local traffic management load balancing to Layer 4 with Spectrum","summary":"Cloudflare is adding support for all TCP and UDP traffic to our local traffic management (LTM) load balancing solution, extending the benefits of LTM to more than just HTTP(S) applications","link":"https://blog.cloudflare.com/extending-local-traffic-management-load-balancing-to-layer-4-with-spectrum","published":"2024-05-31T13:00:07Z","feedTitle":" The Cloudflare Blog ","feedAuthor":""},{"title":"NixOS 24.05 released","summary":"Hey everyone, we are Weijia Wang and Jörg Thalheim, the release managers for this stable release and we are very proud to announce the public availability of NixOS 24. 05 “Uakari”. \nNixOS is a Linux distribution, whose set of packages can also be used on other Linux systems and macOS...","link":"https://nixos.org/blog/announcements/2024/nixos-2405/","published":"2024-05-31T11:00:00Z","feedTitle":"NixOS Announcements","feedAuthor":""},{"title":"#WeblogPoMo2024 retrospective","summary":"It’s the last day of #WeblogPoMo2024, so I thought I’d take a quick look back at the month and see how it has gone. \nOverall, I’m kind of impressed I’m even writing a post on the last day.  Honestly, I expected to maybe manage the first 7-or-so days, but in fact I managed to write 19 consecutive blog posts (and that’s not counting the intro post on the 30th of April)...","link":"https://lewisdale.dev/post/weblogpomo2024-retrospective/","published":"2024-05-31T08:00:52Z","feedTitle":"LewisDale.dev","feedAuthor":""},{"title":"Cryptocurrency companies have raised over $135 million to influence US elections this cycle, and they’re just getting started","summary":"As election season kicks into high gear, we need to watch how cryptocurrency companies are influencing US politics","link":"https://www.citationneeded.news/2024-cryptocurrency-election-spending/","published":"2024-05-30T19:37:56Z","feedTitle":"Citation Needed","feedAuthor":""},{"title":"May 29th, 2024 - What is next for Kagi","summary":"Today we celebrate the two-year anniversary of Kagi launching as a paid service.  🎉\n\nWe have a comprehensive blog post detailing everything we have achieved and our plans for the future. \n\nhttps://blog...","link":"https://kagifeedback.org/d/4166-may-29th-2024-what-is-next-for-kagi/1","published":"2024-05-30T16:07:30Z","feedTitle":"Activity in the release-notes tag","feedAuthor":""}]
