[{"title":"Adding chart.js to Hugo","summary":"Let's find out how to add chart. js to your static website built with Hugo.","link":"https://kmcd.dev/posts/hugo-chartjs/","published":"2024-05-28T00:00:00Z","feedTitle":"kmcd.dev","feedAuthor":""},{"title":"La vie en ROSI","summary":"As I wandered the barren wasteland that is LinkedIn, something absolutely not interesting caught my eye.  A brand new acronym that I haven't seen before: ROSI.  I was sure that I was witnessing a pivotal moment...","link":"https://crankysec.com/blog/rosi/","published":"2024-05-27T00:00:00Z","feedTitle":"CrankySec","feedAuthor":"Scarlett Cavendish"},{"title":"Indie Game Boy games","summary":"Since buying a new handheld emulator this year, I’ve been hunting for some fun games to play.  I’ve got a library of just about every Game Boy/Colour[1]/Advance game that was released in the original run, but that means a lot of low-quality games with a handful of really good ones. \nI recently found out about the indie Game Boy dev scene though, which looks really interesting...","link":"https://lewisdale.dev/post/indie-game-boy-games/","published":"2024-05-26T07:45:52Z","feedTitle":"LewisDale.dev","feedAuthor":""},{"title":"omg.lol’s People Principles","summary":"omg. lol’s People Principles\nWhen you sign up for and use a service, especially a paid service like omg. lol, you should know what you’re supporting...","link":"https://omglol.news/2024/05/26/omg-lols-people-principles","published":"2024-05-26T04:35:00Z","feedTitle":"The Omg Lol Times","feedAuthor":""},{"title":"987.1 Cayman 2nd Event","summary":"In between the first and second autocross I made the first suspension change: stiffer bump stops.  The difference was amazing.  Ten seconds into the first run I knew that, if I continued to develop the car (and the driver) it could be competitive in C-Street against the ND2 Miatas...","link":"https://edfishjr.com/2024/05/25/987-1-cayman-2nd-event/","published":"2024-05-25T20:35:36Z","feedTitle":"Saving Time – An Autocrosser's Blog","feedAuthor":""},{"title":"Tailscale and TunnelVision: our analysis","summary":"Since the disclosure of the TunnelVision bug some users have asked us whether and how it affects Tailscale.  The short answer: it’s complicated.  While we don’t think TunnelVision constitutes a major security concern for most Tailscale users, some users may be affected","link":"https://tailscale.com/blog/tunnelvision-analysis","published":"2024-05-24T20:30:00Z","feedTitle":"Blog on Tailscale","feedAuthor":""},{"title":"Expanding egress traffic visibility","summary":"Today we’re bringing a new network visibility option to our Enterprise customers by allowing them to monitor destination addresses for traffic egressing the network through an exit node.  This will allow customers to run more advanced forensic analyses during active or historical security incidents","link":"https://tailscale.com/blog/egress-logging","published":"2024-05-24T19:00:00Z","feedTitle":"Blog on Tailscale","feedAuthor":""},{"title":"Stark Industries Solutions: An Iron Hammer in the Cloud","summary":"Two weeks before Russia invaded Ukraine in February 2022, a large, mysterious new Internet hosting firm called Stark Industries Solutions materialized and quickly became the epicenter of massive distributed denial-of-service (DDoS) attacks on government and commercial targets in Ukraine and Europe.  An investigation into Stark Industries reveals it is being used as a global proxy network that conceals the true source of cyberattacks and disinformation campaigns against enemies of Russia","link":"https://krebsonsecurity.com/2024/05/stark-industries-solutions-an-iron-hammer-in-the-cloud/","published":"2024-05-23T23:32:43Z","feedTitle":"Krebs on Security","feedAuthor":""},{"title":"Vagrant Cloud is moving to HCP","summary":"Vagrant Cloud is moving to HashiCorp Cloud Platform (HCP) as the HCP Vagrant Registry","link":"https://www.hashicorp.com/blog/vagrant-cloud-is-moving-to-hcp","published":"2024-05-23T15:20:00Z","feedTitle":"HashiCorp Blog","feedAuthor":"HashiCorp, Inc."},{"title":"","summary":"• 🐛 Fixed an issue that would bring back the wrong date range for archived sites, especially when retrieving the first and last hit recorded","link":"https://updates.tinylytics.app/post/2024-05-23-1","published":"2024-05-23T15:18:56Z","feedTitle":"Tinylytics Updates","feedAuthor":""},{"title":"A Comprehensive Evaluation of Various Search Engines I've Used","summary":"","link":"https://capsule.jbowdre.lol/gemlog/2024-05-23-a-comprehensive-evaluation-of-various-search-engines-i-ve-used.gmi","published":"2024-05-23T14:42:41Z","feedTitle":"📡 jbowdre's gemlog","feedAuthor":"John Bowdre"},{"title":"The risk in malicious AI models: Wiz Research discovers critical vulnerability in AI-as-a-Service provider, Replicate","summary":"The Wiz Research team's investigations into AI-as-a-service providers reveals a major risk to AI systems.","link":"https://www.wiz.io/blog/wiz-research-discovers-critical-vulnerability-in-replicate","published":"2024-05-23T13:58:31Z","feedTitle":"Wiz Blog | RSS feed","feedAuthor":""},{"title":"Privacy, human rights, and Tornado Cash","summary":"I am more worried about privacy than crypto crime","link":"https://www.citationneeded.news/tornado-cash/","published":"2024-05-23T12:56:11Z","feedTitle":"Citation Needed","feedAuthor":""},{"title":"A new changelog site","summary":"You know, one of the reasons I created Scribbles (where this is written) is for exactly for this reason, to have a quick way to get updates out for all my little side projects — and switch between them. \n\nAnd now there is the Tinylytics Changelog that you can find","link":"https://updates.tinylytics.app/post/a-new-changelog-site","published":"2024-05-23T10:57:55Z","feedTitle":"Tinylytics Updates","feedAuthor":""},{"title":"","summary":"• 🚀 Introduced our new changelog, this one.  This is just way easier for me to manage.  If you want to see the old one, you can find it here...","link":"https://updates.tinylytics.app/post/2024-05-23","published":"2024-05-23T10:18:55Z","feedTitle":"Tinylytics Updates","feedAuthor":""},{"title":"Adding some slashpages","summary":"Yesterday, Robb launched slashpages. net, which is a simple listing of all of the different /-x pages that people have been adding to their personal sites. \nI used to have a /now page, but I never maintained it so I’ve removed it[1]...","link":"https://lewisdale.dev/post/adding-some-slashpages/","published":"2024-05-23T07:41:00Z","feedTitle":"LewisDale.dev","feedAuthor":""},{"title":"A Comprehensive Evaluation of Various Search Engines I've Used","summary":"Call me old fashioned, but when I want to find out about something my first instinct is not to chat with a computer.  I'm not interested in a conversational back-and-forth or a probably-at-least-partially-incorrect summary, I just want to find the authoritative resources that can tell me about a thing.  So I use a search engine, and I've used a lot of different search engines over the past ~5 years or so...","link":"https://blog.jbowdre.lol/a-comprehensive-evaluation-of-various-search-engines-ive-used/","published":"2024-05-23T05:00:00Z","feedTitle":"jbowdre's weblog","feedAuthor":"jbowdre"},{"title":"Why I'm Rebranding","summary":"Find out why the name of this website changed","link":"https://kmcd.dev/posts/why-im-rebranding/","published":"2024-05-23T00:00:00Z","feedTitle":"kmcd.dev","feedAuthor":""},{"title":"Bitwarden Upholds High Security Standards with Annual Third-Party Audits","summary":"Bitwarden will continue to uphold high cybersecurity standards through annual third-party security audits of the Bitwarden product and service","link":"https://bitwarden.com/blog/third-party-security-audit/","published":"2024-05-23T00:00:00Z","feedTitle":"Bitwarden Blog","feedAuthor":""}]
