[{"title":"Our blogging inspiration","summary":"I've met a few people who want to start blogging, or blog more often, but have trouble coming up with things to write about.  This inspired me to write about what inspires me (the meta world of blogging). \nI would also love to read about what inspires other bloggers...","link":"https://birming.com/our-blogging-inspiration/","published":"2024-06-17T17:03:00Z","feedTitle":"Robert Birming","feedAuthor":"robert","homepage":"https://birming.com/"},{"title":"My blogging inspiration","summary":"Most of my posts are inspired by everyday experiences.  It could be something that happened at work or a conversation I overheard in a coffee shop.  There are endless blog posts up for grabs if we pay attention to our surroundings...","link":"https://birming.com/my-blogging-inspiration/","published":"2024-06-17T17:02:00Z","feedTitle":"Robert Birming","feedAuthor":"robert","homepage":"https://birming.com/"},{"title":"Week Notes June 10-16","summary":"Slowly getting back in the saddle as they say, and trying to find a sense of routine now I've moved to the Bear Park to picnic with the cool Bears.  It's fun, I feel more inspired, and have connected with a number of people and discovered several new reads over this last week. \nI also retired from #Junited2024 as I kind of started to miss way to many entries, though I continue to enjoy all the links everyone else is posting...","link":"https://alexandrawolfe.ca/week-notes-june-10-16/","published":"2024-06-17T16:00:01.204656Z","feedTitle":"Alexandra's Notebook","feedAuthor":"awolfe","homepage":"https://alexandrawolfe.ca/"},{"title":"New Terraform integrations with Cisco, Dell, Red Hat, ServiceNow, and more","summary":"17 new Terraform integrations from 13 partners provide more options to automate and secure cloud infrastructure management","link":"https://www.hashicorp.com/blog/new-terraform-integrations-with-cisco-dell-red-hat-servicenow-and-more","published":"2024-06-17T16:00:00Z","feedTitle":"HashiCorp Blog","feedAuthor":"HashiCorp, Inc.","homepage":"https://hashicorp.com/blog"},{"title":"Pluralistic: Bankruptcy is very, very good (17 Jun 2024)","summary":"Today's links Bankruptcy is very, very good: \"A large increase in earned income, employment, assets, real estate, secured debt, home ownership, and wealth that persists for more than 25 years after a court ruling. \" Hey look at this: Delights to delectate.  This day in history: 2004, 2009, 2014, 2023 Upcoming appearances: Where to find me...","link":"https://pluralistic.net/2024/06/17/lovilee-jubilee/","published":"2024-06-17T15:47:26Z","feedTitle":"Pluralistic: Daily links from Cory Doctorow","feedAuthor":"","homepage":"https://pluralistic.net"},{"title":"29 Years!","summary":"The big anniversary post for this year was a couple of days ago, so I won’t rehash it here.  This is just to say that it’s been a good 29 years.  — JS","link":"https://whatever.scalzi.com/2024/06/17/29-years/","published":"2024-06-17T15:39:22Z","feedTitle":"Whatever","feedAuthor":"","homepage":"https://whatever.scalzi.com"},{"title":"Incy Wincy","summary":"“Incy wincy spider crawled across the wall\nIncy wincy spider doesn’t care at all\nAs incy wincy spider know I won’t squish him\nOr crush him with a tissue and throw him in the bin. ”\nDespite being terrified of spiders, as a child—and for good reason, living abroad meant we were in contact with monsters that grew to a seemingly unnatural size—as an adult, I have become more tolerant and even, dare I say it, almost best friends with one particular variety of spider. \nThe dashing, and rather well named Zebra Spider...","link":"https://alexandrawolfe.ca/incy-wincy/","published":"2024-06-17T14:33:00Z","feedTitle":"Alexandra's Notebook","feedAuthor":"awolfe","homepage":"https://alexandrawolfe.ca/"},{"title":"Weeknotes","summary":"A happy Week","link":"https://binarydigit.cafe/june-16/","published":"2024-06-17T13:41:00Z","feedTitle":"BinaryDigit","feedAuthor":"binarydigit","homepage":"https://binarydigit.cafe/"},{"title":"Why I'm Still on Facebook","summary":"No one needs to convince me that Mark Zuckerburg is an evil techbro or that Facebook is net negative on society and responsible for the undermining of American democracy in 2016 when it promoted an orangutan hued failed gameshow host to shock and awe his way into the White House","link":"https://louplummer.lol/post/why-i-m-still-on-facebook","published":"2024-06-17T11:54:43Z","feedTitle":"Living Out Loud","feedAuthor":"","homepage":"https://louplummer.lol"},{"title":"Using LLMs to Exploit Vulnerabilities","summary":"Interesting research: “Teams of LLM Agents can Exploit Zero-Day Vulnerabilities. ”\nAbstract: LLM agents have become increasingly sophisticated, especially in the realm of cybersecurity.  Researchers have shown that LLM agents can exploit real-world vulnerabilities when given a description of the vulnerability and toy capture-the-flag problems...","link":"https://www.schneier.com/blog/archives/2024/06/using-llms-to-exploit-vulnerabilities.html","published":"2024-06-17T11:08:19Z","feedTitle":"Schneier on Security","feedAuthor":"","homepage":"https://www.schneier.com"}]
