[{"title":"Settling into my new (notes) home","summary":"Well, hello there. I went back and forth on whether or not I wanted to make the move from my former (Notes) blogging platform to Bear blog.  I listed out some pros and cons in one of my previous posts1, and I really thought I was going to stay put for a little bit...","link":"https://notes.jeddacp.com/settling-into-my-new-notes-home/","published":"2024-06-06T23:07:00Z","feedTitle":"Notes by JCProbably","feedAuthor":"jedda"},{"title":"Dutch political websites hit by cyber attacks as EU voting starts","summary":"The 2024 European Parliament election began in the Netherlands on June 6.  Cloudflare mitigated several multi-hour DDoS attacks on Dutch political websites on June 5 and 6","link":"https://blog.cloudflare.com/dutch-political-websites-hit-by-cyber-attacks-as-eu-voting-starts","published":"2024-06-06T19:23:17Z","feedTitle":" The Cloudflare Blog ","feedAuthor":""},{"title":"Connect, collaborate, and chat tech! Bunny Discord channel is now live!","summary":"Building a faster internet is all about collaboration.  That's why we're excited to announce the official bunny. net Discord channel...","link":"https://bunny.net/blog/join-us-on-discord/","published":"2024-06-06T14:37:48Z","feedTitle":"bunny.net Blog","feedAuthor":""},{"title":"I really like everyone on my blogroll, but I'm sorry to say that it must die","summary":"Something that I've had to come to terms with over the course of the nearly forty fucking years I've existed on this godforsaken planet is that I am, by default, a very anxious people-pleaser.  While I may come off as the embodiment of calm, cool, collected, and everyone agrees that I seem extremely super normal, and not at all dripping with insecurity about nearly every goddamned facet of my entire being.  I have to pull back the veil, dear reader, and admit that it's all a ruse...","link":"https://gkeenan.co/avgb/i-really-like-everyone-on-my-blogroll-but-im-sorry-to-say-that-it-must-die","published":"2024-06-06T11:36:40Z","feedTitle":"A Very Good Blog by Keenan","feedAuthor":""},{"title":"Protecting vulnerable communities for 10 years with Project Galileo","summary":"In celebration of Project Galileo's 10th anniversary, we want to give you a snapshot of what organizations that work in the public interest experience on an everyday basis when it comes to keeping their websites online","link":"https://blog.cloudflare.com/galileo10anniversaryradardashboard","published":"2024-06-06T10:00:23Z","feedTitle":" The Cloudflare Blog ","feedAuthor":""},{"title":"Terraform adds granular permissions to manage agent pools","summary":"HCP Terraform and Terraform Enterprise eliminate the need to rely on owner permissions to manage agent pools, streamlining permissions workflows and reducing risk","link":"https://www.hashicorp.com/blog/terraform-adds-granular-permissions-to-manage-agent-pools","published":"2024-06-06T07:00:00Z","feedTitle":"HashiCorp Blog","feedAuthor":"HashiCorp, Inc."},{"title":"Further Down the Bunny Hole","summary":"It wasn't too long ago (January, in fact) that I started hosting this site with Neocities.  I was pretty pleased with that setup, but a few weeks ago my monitoring setup started reporting that the site was down.  And sure enough, trying to access the site would return a generic error message stating that the site was unknown...","link":"https://runtimeterror.dev/further-down-the-bunny-hole/","published":"2024-06-06T00:00:00Z","feedTitle":"runtimeterror","feedAuthor":""},{"title":"HashiCorp at re:Inforce: Security Lifecycle Management with AWS","summary":"HashiCorp will be at AWS re:Inforce sharing expert talks, product demos, and news announcements","link":"https://www.hashicorp.com/blog/hashicorp-at-re-inforce-security-lifecycle-management-with-aws","published":"2024-06-05T16:00:00Z","feedTitle":"HashiCorp Blog","feedAuthor":"HashiCorp, Inc."},{"title":"Life on the edge: Networking challenges of AI deployments","summary":"If you’ve deployed an AI model to a remote device before, then you’ll know that connecting to it and keeping it secure aren’t exactly easy.  Existing edge device tooling from cloud providers has been built around entirely different workloads, focused mostly on streaming low bandwidth sensor data to a centralized location.  For more complex AI workloads, edge deployments lack most of the mature connectivity, security, and orchestration tooling available in a typical public cloud region...","link":"https://tailscale.com/blog/ai-new-internet","published":"2024-06-05T15:00:27Z","feedTitle":"Blog on Tailscale","feedAuthor":""},{"title":"Sail Further with Wiz Cost Optimization for Amazon EKS ","summary":"Learn how Wiz's latest feature identifies outdated EKS clusters, helping organizations save millions on cloud spend.  Find out how to optimize costs and reinvest savings in strategic initiatives","link":"https://www.wiz.io/blog/wiz-cost-optimization-aws-eks-extended-support","published":"2024-06-05T13:44:36Z","feedTitle":"Wiz Blog | RSS feed","feedAuthor":""},{"title":"European Union elections 2024: securing democratic processes in light of new threats","summary":"Between 6 and 9 June 2024, hundreds of millions of EU citizens will be voting to elect their members of the European Parliament (MEPs).  All EU member states have different election processes, institutions and methods, and the security risks are significant","link":"https://blog.cloudflare.com/eu-elections-2024","published":"2024-06-05T13:00:46Z","feedTitle":" The Cloudflare Blog ","feedAuthor":""},{"title":"Wiz achieves StateRAMP authorization","summary":"Great news for State and Local Governments.  Wiz for Gov is now StateRAMP authorized","link":"https://www.wiz.io/blog/wiz-achieves-stateramp-authorization","published":"2024-06-05T09:31:27Z","feedTitle":"Wiz Blog | RSS feed","feedAuthor":""},{"title":"2024.6: Dipping our toes in the world of AI using LLMs 🤖","summary":"Home Assistant Core 2024. 6.  🎉\nWelcome to another loaded release of Home Assistant...","link":"https://www.home-assistant.io/blog/2024/06/05/release-20246/","published":"2024-06-05T00:00:00Z","feedTitle":"Home Assistant","feedAuthor":"Home Assistant"},{"title":"Elevating Enterprise Compliance: Bitnami's Game-Changing Salt Integration Unveiled","summary":"The VMWare Tanzu blog recently announced that Bitnami added the Salt Minion into Bitnami images available in the Bitnami Application Catalog","link":"https://saltproject.io/blog/elevating-enterprise-compliance/","published":"2024-06-05T00:00:00Z","feedTitle":"Blog on Salt Project","feedAuthor":""},{"title":"Code signing with HashiCorp Vault and GitHub Actions","summary":"Code signing is an essential element of software supply chain security, enabling users of your code to verify that the code they are running is actually code you released.  This helps defend against supply chain attacks such as dependency confusion attacks. At a high level, code signing workflows depend on four components:An artifact that must be signed before being distributed...","link":"https://medium.com/hashicorp-engineering/code-signing-with-hashicorp-vault-and-github-actions-5272dbae52f2?source=rss----9a924bda51d6---4","published":"2024-06-04T16:54:15Z","feedTitle":"HashiCorp Solutions Engineering Blog - Medium","feedAuthor":""},{"title":"Zach Gage thinks he can bribe me into talking about Pile-Up Poker, the new game on Puzzmo","summary":"Zach Gage found my website.  Apparently I was a bit too effusive with my praise for Puzzmo back when it first launched, and that led this game boy to believe he could send me an email appealing to my deep-seated need for validation.  Well, joke's on him, because despite my complete lack of shame, I can not, will not, have not, shan't, and also REFUSE TO be manipulated into talking about Pile-Up Poker, Puzzmo's new game that just officially launched yesterday, June 3(rd), 2024...","link":"https://gkeenan.co/avgb/zach-gage-thinks-he-can-bribe-me-into-talking-about-pile-up-poker-the-new-game-on-puzzmo","published":"2024-06-04T16:36:57Z","feedTitle":"A Very Good Blog by Keenan","feedAuthor":""},{"title":"Get the Best In Email: How Domenic Uses Fastmail","summary":"Fastmail makes it easy to organize and prioritize the messages that are most important to you.  Domenic, a web developer, uses Fastmail personal domains, aliases, folders, labels, and more. \nThe post Get the Best In Email: How Domenic Uses Fastmail appeared first on Fastmail...","link":"https://www.fastmail.com/blog/get-the-best-in-email-how-domenic-uses-fastmail/","published":"2024-06-04T16:00:00Z","feedTitle":"Fastmail","feedAuthor":""},{"title":"987.1 Cayman in C-Street: 3rd \u0026 4th Events","summary":"We had a two day event this weekend.  The bad part was that there was rain both days.  Not much good for testing...","link":"https://edfishjr.com/2024/06/04/987-1-cayman-in-c-street-3rd-4th-events/","published":"2024-06-04T15:46:56Z","feedTitle":"Saving Time – An Autocrosser's Blog","feedAuthor":""},{"title":"Daily Prompts","summary":"Kickstart your creative juices with a daily writing prompt","link":"https://kmcd.dev/posts/daily-prompts/","published":"2024-06-04T10:00:00Z","feedTitle":"kmcd.dev","feedAuthor":""},{"title":"HCP Waypoint to add actions, enhances golden pattern capabilities, and more","summary":"The beta of HCP Waypoint actions — coming soon — will let platform teams expose Day 2+ operations and workflows to developers.  Plus: enhancements to HCP Waypoint templates and add-ons","link":"https://www.hashicorp.com/blog/hcp-waypoint-adds-actions-enhancements-to-golden-pattern-capabilities-and-more","published":"2024-06-04T08:00:00Z","feedTitle":"HashiCorp Blog","feedAuthor":"HashiCorp, Inc."}]
